export const API_URL = process.env.NEXT_PUBLIC_API_URL;
export const REAL_FAKE_DATA = [
    {
        "type": "Товарный бетон",
        "typeSlug": "beton",
        "countProducts": 3,
        "categories": [
            {
                "category": "БЕТОН НА ГРАВИЙНОМ ЩЕБНЕ",
                "categorySlug": "гравийный1",
                "countProducts": 1,
                "products": [
                    {
                        "id": 1,
                        "name": "Бетон М100 B7,5 F100 W4 (Гравий)",
                        "price": 3300,
                        "contents": {
                            "Наполнитель": "Гравий",
                            "Подвижность": "П4",
                            "Класс бетона": "В7,5",
                            "Плотность (кг/м^3)": "2265",
                            "Морозостойкость, F": "F100",
                            "Средняя прочность": "125",
                            "Водонепроницаемость": "W4"
                        },
                        "urlIMG": "https://imgur.com/6vlKMyZ",
                        "description": ""
                    }
                ]
            },
            {
                "category": "БЕТОН НА ОБЫЧНОМ ЩЕБНЕ",
                "categorySlug": "гравийный2",
                "countProducts": 1,
                "products": [
                    {
                        "id": 2,
                        "name": "Бетон М200 B15 F150 W4 (Гравий)",
                        "price": 3500,
                        "contents": {
                            "Наполнитель": "Гравий",
                            "Подвижность": "П1, П2, П3, П4, П5",
                            "Класс бетона": "B15",
                            "Плотность (кг/м^3)": "2330",
                            "Морозостойкость, F": "F100",
                            "Средняя прочность": "196",
                            "Водонепроницаемость": "W4"
                        },
                        "urlIMG": "https://imgur.com/uPAULhB",
                        "description": ""
                    }
                ]
            }
        ],
        "products": [
            {
                "id": 3,
                "name": "Бетон М100 B7,5 F100 W4 (Гравий)",
                "price": 3300,
                "contents": {
                    "Наполнитель": "Гравий",
                    "Подвижность": "П4",
                    "Класс бетона": "В7,5",
                    "Плотность (кг/м^3)": "2265",
                    "Морозостойкость, F": "F100",
                    "Средняя прочность": "125",
                    "Водонепроницаемость": "W4"
                },
                "urlIMG": "https://imgur.com/6vlKMyZ",
                "description": ""
            },
            {
                "id": 4,
                "name": "Бетон М150 B12,5 F100 W4 (Гравий)",
                "price": 3300,
                "contents": {
                    "Наполнитель": "Гравий",
                    "Подвижность": "П1, П2, П3, П4, П5",
                    "Класс бетона": "B10/12,5",
                    "Плотность (кг/м^3)": "2265",
                    "Морозостойкость, F": "F100",
                    "Средняя прочность": "125",
                    "Водонепроницаемость": "W4"
                },
                "urlIMG": "https://imgur.com/6bg43cj",
                "description": ""
            },
            {
                "id": 5,
                "name": "Бетон М200 B15 F150 W4 (Гравий)",
                "price": 3500,
                "contents": {
                    "Наполнитель": "Гравий",
                    "Подвижность": "П1, П2, П3, П4, П5",
                    "Класс бетона": "B15",
                    "Плотность (кг/м^3)": "2330",
                    "Морозостойкость, F": "F100",
                    "Средняя прочность": "196",
                    "Водонепроницаемость": "W4"
                },
                "urlIMG": "https://imgur.com/uPAULhB",
                "description": ""
            }

        ]
    },
    {
        "type": "Арматура",
        "typeSlug": "armatura",
        "countProducts": 2,
        "categories": [
            {
                "category": "АМАТАТУРА 1",
                "categorySlug": "арматураСлаг1",
                "countProducts": 1,
                "products": [
                    {
                        "id": 6,
                        "name": "А Бетон М100 B7,5 F100 W4 (Гравий)",
                        "price": 3300,
                        "contents": {
                            "Наполнитель": "Гравий",
                            "Подвижность": "П4",
                            "Класс бетона": "В7,5",
                            "Плотность (кг/м^3)": "2265",
                            "Морозостойкость, F": "F100",
                            "Средняя прочность": "125",
                            "Водонепроницаемость": "W4"
                        },
                        "urlIMG": "https://imgur.com/6vlKMyZ",
                        "description": ""
                    }
                ]
            },
            {
                "category": "АМАТАТУРА 2",
                "categorySlug": "арматураСлаг2",
                "countProducts": 1,
                "products": [
                    {
                        "id": 7,
                        "name": "А Бетон М200 B15 F150 W4 (Гравий)",
                        "price": 3500,
                        "contents": {
                            "Наполнитель": "Гравий",
                            "Подвижность": "П1, П2, П3, П4, П5",
                            "Класс бетона": "B15",
                            "Плотность (кг/м^3)": "2330",
                            "Морозостойкость, F": "F100",
                            "Средняя прочность": "196",
                            "Водонепроницаемость": "W4"
                        },
                        "urlIMG": "https://imgur.com/uPAULhB",
                        "description": ""
                    }
                ]
            }
        ],
        "products": [
            {
                "id": 8,
                "name": "А Бетон М100 B7,5 F100 W4 (Гравий)",
                "price": 3300,
                "contents": {
                    "Наполнитель": "Гравий",
                    "Подвижность": "П4",
                    "Класс бетона": "В7,5",
                    "Плотность (кг/м^3)": "2265",
                    "Морозостойкость, F": "F100",
                    "Средняя прочность": "125",
                    "Водонепроницаемость": "W4"
                },
                "urlIMG": "https://imgur.com/6vlKMyZ",
                "description": ""
            },
            {
                "id": 9,
                "name": "А Бетон М200 B15 F150 W4 (Гравий)",
                "price": 3500,
                "contents": {
                    "Наполнитель": "Гравий",
                    "Подвижность": "П1, П2, П3, П4, П5",
                    "Класс бетона": "B15",
                    "Плотность (кг/м^3)": "2330",
                    "Морозостойкость, F": "F100",
                    "Средняя прочность": "196",
                    "Водонепроницаемость": "W4"
                },
                "urlIMG": "https://imgur.com/uPAULhB",
                "description": ""
            }

        ]
    }
]